In [323]:
import pandas as pd
import numpy as np
import string
import re

# Notes:

You are banned from using loops (`for` or `while` or any other) for this entire workshop!

You shouldn't be using loops almost ever with pandas in any case, so break out of the habit now.

## 1. DataFrame basics


Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**1.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

**2.** Select only the rows where visits are 3 or more. Which types of animals are these?

**3.** Select the rows where visists are 3 and the animal is a cat

**4.** Calculate the sum of all visits in `df` (i.e. the total number of visits).

**5.** Calculate the mean age for each different animal in `df`.

**6.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [26]:
# Question 1: Create a DataFrame df from this dictionary data which has the index labels.

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data)
df.index = labels
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [13]:
# Question 2: Select only the rows where visits are 3 or more. Which types of animals are these?

visits = df.loc[df["visits"] >= 3]
visits

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

In [15]:
# Question 3: Select the rows where visists are 3 and the animal is a cat

visits.loc[visits["animal"] == "cat"]

  animal  age  visits priority
b    cat  3.0       3      yes
f    cat  2.0       3       no

In [16]:
# Question 4: Calculate the sum of all visits in df (i.e. the total number of visits).
df["visits"].sum()

19

In [17]:
# Question 5: Calculate the mean age for each different animal in df.
df["age"].mean()

3.4375

In [35]:
# Question 6: Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.
df = df.append(pd.Series(data = {"animal": "bird", "age": 4, "visits": 3, "priority": "no"}, name="k"), ignore_index = False)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
k   bird  4.0       3       no

In [36]:
# Question 6: Part 2
df = df.drop(["k"])
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

# 2.1 Shifty problem

You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

```python
1, 2, 3, 4, 5, 6, 7
```

### Hint: use the `shift()` method

In [141]:
# Couldn't figure out why/how to use shift()
# Javad showed me how shift() can work
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df = df.drop_duplicates(keep = "first")
df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

# 2.2 columns sum min

Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? Return that column's label.

In [61]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

In [83]:
# separated the df into it's own cell because everytime I ran it, values reset
df.sum(axis=0).idxmin()

'g'

# 2.3 Duplicates

How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

**hint:** There's a method for to find duplicate rows for you

In [84]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
len(df.drop_duplicates(keep = False))

4

# 2.4 Group Values

A DataFrame has a column of groups 'grps' and and column of integer values 'vals': 

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values.  You should end up with the answer as follows:
```
grps
a    409
b    156
c    345
```

In [117]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df.groupby("grps").vals.nlargest(3, keep = "all").groupby("grps").sum()

grps
a    409
b    156
c    345
Name: vals, dtype: int64

# 3. Cleaning Data

### Making a DataFrame easier to work with

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

Formatted, it looks like this:

```
            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"
```

**1.** Some values in the the **FlightNumber** column are missing (they are `NaN`). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify `df` to fill in these missing numbers and make the column an integer column (instead of a float column).

In [217]:
# Received from Javad
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

flights = np.arange(df.loc[0, "FlightNumber"], df.loc[len(df) -1, "FlightNumber"] + 10, 10, dtype=int)
df.FlightNumber = flights
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 3.2 column splitting

The **From\_To** column would be better as two separate columns! Split each string on the underscore delimiter `_` to make two new columns `From` and `To` to your dataframe.

In [337]:
# Received from Javad
df["From"] = df.From_To.apply(lambda x: x.split("_")[0].capitalize())
df["To"] = df.From_To.apply(lambda x: x.split("_")[1].capitalize())
df = df.drop(columns=['From_To'])
df

AttributeError: 'DataFrame' object has no attribute 'From_To'

# 3.3 Clean Text

Make the text in your dataframe:

- From and To columns should be lowercase with only first letter capitalized

- In the **Airline** column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [204]:
# Received from Javad
s = string.punctuation
s += "1234567890 "
s

'!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~1234567890 '

In [205]:
def cleanup(a):
    return a.strip(s)

In [336]:
df.Airline = df.Airline.apply(lambda x: cleanup(x))
df

AttributeError: 'DataFrame' object has no attribute 'Airline'

# Exercise 4.1: Column Splitting

Given the unemployment data in `data/country_total.csv`, split the `month` column into two new columns: a `year` column and a `month` column, both integers

In [227]:
df = pd.read_csv("data/country_total.csv")
df["year"] = df.month.apply(lambda x: int(str(x).split(".")[0]))
df["month"] = df.month.apply(lambda x: int(str(x).split(".")[1]))
df

      country seasonality  month  unemployment  unemployment_rate  year
0          at         nsa      1        171000                4.5  1993
1          at         nsa      2        175000                4.6  1993
2          at         nsa      3        166000                4.4  1993
3          at         nsa      4        157000                4.1  1993
4          at         nsa      5        147000                3.9  1993
...       ...         ...    ...           ...                ...   ...
20791      uk       trend      6       2429000                7.7  2010
20792      uk       trend      7       2422000                7.7  2010
20793      uk       trend      8       2429000                7.7  2010
20794      uk       trend      9       2447000                7.8  2010
20795      uk       trend      1       2455000                7.8  2010

[20796 rows x 6 columns]

# 4.2 Group Statistics

Given the unemployment data in `data/country_sex_age.csv`, give the average unemployment rate for:

- Each gender
- Each Age Group
- Both Together

**HINT:** The `seasonality` column makes it such that the data is repeated for each method of calculating unemployment (`nsa`, `trend`, etc.). Can you ignore this and group over it? Or should you take the average for each?

In [269]:
df = pd.read_csv("data/country_sex_age.csv")

group = df.groupby(["sex", "age_group"])
both = df.unemployment_rate.mean()

print(group.unemployment_rate.mean())
print("------------")
print(both)

sex  age_group
f    y25-74        7.566771
     y_lt25       18.457435
m    y25-74        6.244016
     y_lt25       17.098036
Name: unemployment_rate, dtype: float64
------------
12.325057479882076

# 4.3 Estimating group size

Given that we have the unemployment **rate** as a % of total population, and the number of total unemployed, we can estimate the total population.

Give an estimate of the total population for men and women in each age group.

Does this change depending on the unemployment seasonality calculation method?

In [291]:
# Received help from Javad
df["population"] = df.groupby(["sex","age_group", "country", "month"], as_index=False, group_keys=False).apply(lambda x: x.unemployment * (100 / x.unemployment_rate))
df

,country,seasonality,sex,age_group,month,unemployment,unemployment_rate,population
0,at,nsa,f,y25-74,1993.01,61000,4.5,1.355556e+06
1,at,nsa,f,y25-74,1993.02,62000,4.5,1.377778e+06
2,at,nsa,f,y25-74,1993.03,62000,4.5,1.377778e+06
3,at,nsa,f,y25-74,1993.04,63000,4.6,1.369565e+06
4,at,nsa,f,y25-74,1993.05,63000,4.6,1.369565e+06
...,...,...,...,...,...,...,...,...
83155,uk,trend,m,y_lt25,2010.06,518000,21.1,2.454976e+06
83156,uk,trend,m,y_lt25,2010.07,513000,20.8,2.466346e+06
83157,uk,trend,m,y_lt25,2010.08,509000,20.5,2.482927e+06
83158,uk,trend,m,y_lt25,2010.09,513000,20.7,2.478261e+06
83159,uk,trend,m,y_lt25,2010.10,520000,21.1,2.464455e+06

# 5.1 Tennis

In `data/tennis.csv` you have games that Roger Federer played against various opponents. Questions:

1. How many games did Federer win?

2. What is Federer's win/loss ratio?

3. Who were Federer's top 5 opponents?

In [391]:
# Received help from Javad for #3
df = pd.read_csv("data/tennis.csv")
wins = df.win[df.win == True]
losses = df.win[df.win == False]

print(f"Wins: {len(wins)}")
print(f"Ratio: {len(wins)/len(losses)}")
opponents = df["player2 total points total"].nlargest(5, keep = "all").index
df.opponent[opponents]

Wins: 972
Ratio: 4.695652173913044

867         Andy Roddick (USA)
779         Rafael Nadal (ESP)
545          Marat Safin (RUS)
95     Michel Kratochvil (SUI)
468     David Nalbandian (ARG)
Name: opponent, dtype: object

# 5.2 Over time

1. What was Federer's best year? In terms of money, and then in terms of number of wins

2. Did Federer get better or worse over time?

In [392]:
def cleanup(x):
    return re.sub("[a-zA-Z$,]", "", str(x))

In [407]:
df["tournament prize money"] = df["tournament prize money"].apply(lambda x : cleanup(x))

df["tournament prize money"] = df["tournament prize money"].apply(lambda x : int(x) if x != "" else 0)

group = df.groupby("year")["tournament prize money", "win"].sum()

print(f"His best year in terms of money won was {group['tournament prize money'].idxmax()}. His best year in terms of wins was {group['win'].idxmax()}")

His best year in terms of money won was 2007. His best year in terms of wins was 2006

C:\Users\rando\anaconda3\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """

# 5.3 Total money won

In the data, you'll find the `tournament round`, one value of which, `F` indicates the final.

Assuming Federer wins the money in the `tournament prize money` if he wins a final in a tournament, how much money has Federer made in tournaments in this dataset?

In [428]:
total = 0

df["final won"] = df["tournament round"].apply(lambda x: True if re.match("F", x) else False)

final = df.loc[df["final won"] == True]
print(f"Assuming he only wins the money if he wins in a final, Federer has won {final['tournament prize money'].sum()} $")

Assuming he only wins the money if he wins in a final, Federer has won 54761874 $